---
kind: enumMember
id: F:Autodesk.Revit.DB.ResourceVersionStatus.Unknown
enum: Autodesk.Revit.DB.ResourceVersionStatus
source: html/d9fae98e-e39a-9b69-07b9-b77cb777800c.htm
---
# Autodesk.Revit.DB.ResourceVersionStatus.Unknown

It is not known whether the resource is current.